DataProcessors/Renault_ОтчетПоПродажамВSedre.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ОтчетПоПродажамВSedre</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ЗаконтрактованныеАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЗаконтрактованныеАвтомобили</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПредварительныхДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыДоговоровНаПродажуАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОкончательныхДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыДоговоровНаПродажуАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыДоговоровНаПродажуАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПокупкаВКредит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСуммаПоАвтомобилю</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСтрокиДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСнятияРезерва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_СостоянияСогласованияКорпСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СостоянияСогласованияКорпСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопИнформация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПредоставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетаНеБудет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПринят</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_ТипыЗаявокНаКорпоротивнуюСкидку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыЗаявокНаКорпоротивнуюСкидку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкидкаПриОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеСкидки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДовозмещениеСкидки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_ТипыОтгрузокНаКорпоративнуюСкидку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыОтгрузокНаКорпоративнуюСкидку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кузовостроители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возмещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оптовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажиСотрудникам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_ОтчетПоПродажамВSedre/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем мВыбраныСсылки; 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяц);
	СписокПродаж.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
	СписокПродаж.Параметры.УстановитьЗначениеПараметра("КонецПериода", Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Период) Тогда
		СписокПродаж.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
		СписокПродаж.Параметры.УстановитьЗначениеПараметра("КонецПериода", Период.ДатаОкончания);
	Иначе
		СписокПродаж.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Дата(1,1,2));
		СписокПродаж.Параметры.УстановитьЗначениеПараметра("КонецПериода", Дата(3000,1,1));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПродажВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СписокПродаж.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокПродажКорпКлиент" Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.КорпКлиент) Тогда
			//@++ Васильев ВА
			Форма = ПолучитьФорму("Справочник.Renault_КорпоративныеКлиенты.Форма.Renault_ФормаКорпоративногоКлиента");
			//@++
			Форма.Ключ = ТекущиеДанные.КорпКлиент.Контрагент;
			Форма.СферыДеятельности = ТекущиеДанные.КорпКлиент.СферыДеятельности.Выгрузить();
			Форма.Автопарк = ТекущиеДанные.КорпКлиент.Автопарк.Выгрузить();
			Форма.Открыть();
		Иначе
			РабочийЛист =  ПолучитьРабочийЛистПоVIN(ТекущиеДанные.VIN);
			КорпКлиент = ПолучитьКорпКлиентаИзРабочегоЛиста(РабочийЛист);
			Если ЗначениеЗаполнено(КорпКлиент) Тогда
				//@++ Васильев ВА
				Форма = ПолучитьФорму("Справочник.Renault_КорпоративныеКлиенты.Форма.Renault_ФормаКорпоративногоКлиента");
				//@++
				Форма.Ключ = КорпКлиент.Контрагент;
				Форма.СферыДеятельности = КорпКлиент.СферыДеятельности.Выгрузить();
				Форма.Автопарк = КорпКлиент.Автопарк.Выгрузить();
				Форма.Открыть();
			Иначе
				Предупреждение("Корпоративный клиент не найден. ");
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СписокПродажЗаявка" Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.Заявка) Тогда
			ОткрытьЗаявкуНаСкидку(ТекущиеДанные);	
		Иначе
			СоздатьЗаявкуНаСкидку(ТекущиеДанные);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СписокПродажСтатус" Тогда
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Статус) Тогда
			СоздатьЗаявкуНаСкидку(ТекущиеДанные);
		ИначеЕсли ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.Черновик") Тогда
			ОткрытьЗаявкуНаСкидку(ТекущиеДанные);
		Иначе
			ОткрытьФормуВИН(ТекущиеДанные)
		КонецЕсли;		
	ИначеЕсли Поле.Имя = "СписокПродажVIN" Тогда
		ИДК = ПолучитьРабочийЛистПоVIN(ТекущиеДанные.VIN);
		Если ЗначениеЗаполнено(ИДК) Тогда
			Renault_CRM.ОткрытьФормуРЛ(ИДК);
		Иначе
			Предупреждение("Рабочий лист по VIN не найден");			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявкуНаСкидку(ТекущиеДанные)
	
	сПараметры = Новый Структура;
	сПараметры.Вставить("Ключ", ТекущиеДанные.Заявка);
	ОткрытьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента",сПараметры);	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаСкидку(ТекущиеДанные)
	
	ФормаНового = ПолучитьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента");
	ДанныеФормы = ФормаНового.Объект;	
	мВыбраныСсылки = ПолучитьВыделеныеСтроки();	
	СоздатьЗаявкуНаСервере(ДанныеФормы, мВыбраныСсылки);
	КопироватьДанныеФормы(ДанныеФормы, ФормаНового.Объект); 
	ФормаНового.Объект.ТипЗаявки = ПредопределенноеЗначение("Перечисление.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.ВозмещениеСкидки");			
	РабочийЛист =  ПолучитьРабочийЛистПоVIN(ТекущиеДанные.VIN);
	КорпКлиент = ПолучитьКорпКлиентаИзРабочегоЛиста(РабочийЛист);
	Если ЗначениеЗаполнено(КорпКлиент) Тогда
		ФормаНового.Объект.Клиент = КорпКлиент;
	КонецЕсли;
	ФормаНового.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВИН(ТекущиеДанные)
	
	сПараметров = Новый Структура;
	сПараметров.Вставить("Заявка", ТекущиеДанные.Заявка);
	сПараметров.Вставить("Автомобиль", ТекущиеДанные.Автомобиль);
	сПараметров.Вставить("Статус", ТекущиеДанные.Статус);
	ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN",сПараметров,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте 
Функция  ПолучитьВыделеныеСтроки ()
	
	мВыбраныСсылки = Новый Массив;
	Для Каждого ВыделеннаяСтрока из Элементы.СписокПродаж.ВыделенныеСтроки Цикл
		мВыбраныСсылки.Добавить(Элементы.СписокПродаж.ДанныеСтроки(ВыделеннаяСтрока));
	КонецЦикла;

	Возврат мВыбраныСсылки;
	
КонецФункции

&НаСервере
Процедура СоздатьЗаявкуНаСервере (ДанныеФормы, мВыбраныСсылки)
	
	ТЗЗарезервированных = Новый ТаблицаЗначений;
	ТЗЗарезервированных.Колонки.Добавить("VIN",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(17)));
	ТЗЗарезервированных.Колонки.Добавить("Автомобиль",Новый ОписаниеТипов("СправочникСсылка.Автомобили"));
	
	Для Каждого СтрокаМассива из мВыбраныСсылки Цикл 
		Если Не ЗначениеЗаполнено(СтрокаМассива.Статус) Тогда 
			СтрокаТЗ = ТЗЗарезервированных.Добавить();
			СтрокаТЗ.VIN = СтрокаМассива.VIN;
			СтрокаТЗ.Автомобиль = СтрокаМассива.Автомобиль;
		КонецЕсли;
	КонецЦикла;
	
	ЗаявкаНаСкидку = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.СоздатьДокумент();
	ЗаявкаНаСкидку.Дата = ТекущаяДата();
	ЗаявкаНаСкидку.УстановитьНовыйНомер();
	ЗаявкаНаСкидку.Клиент = Клиент;
	ЗаявкаНаСкидку.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.ВозмещениеСкидки;
	ЗаявкаНаСкидку.ТипОтгрузки = Перечисления.Renault_ТипыОтгрузокНаКорпоративнуюСкидку.Отгрузка;
	ЗаявкаНаСкидку.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик;
	ЗаявкаНаСкидку.Автор = ПараметрыСеанса.Пользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.VIN,
	|	Таблица.Автомобиль
	|ПОМЕСТИТЬ ВТ_Автомобилей
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Автомобилей.VIN КАК ВИН,
	|	ВТ_Автомобилей.Автомобиль,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиБаза + CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиОпции, 0) КАК ЦенаPVC,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.DEALER_PRICE_BASE + CRM_СостояниеАвтомобилейПроизводителя_v2.DEALER_PRICE_OPTION, 0) КАК ЦенаPVR
	|ИЗ
	|	ВТ_Автомобилей КАК ВТ_Автомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|		ПО ВТ_Автомобилей.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN";
	Запрос.УстановитьПараметр("Таблица", ТЗЗарезервированных);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество () > 0 Тогда
		ЗаявкаНаСкидку.ТаблицаВИН.Загрузить(Результат); 
	КонецЕсли;
	Приемник = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.Renault_ЗаявкаНаКорпоративнуюСкидку")); 
	ЗаполнитьЗначенияСвойств(Приемник, ЗаявкаНаСкидку); 
	Приемник.ТаблицаВИН.Загрузить(ЗаявкаНаСкидку.ТаблицаВИН.Выгрузить()); 
	ЗначениеВДанныеФормы(Приемник, ДанныеФормы);
	мВыбраныСсылки = Новый Массив;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПродажПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокПродаж.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Клиент = ПредопределенноеЗначение("Справочник.Renault_КорпоративныеКлиенты.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	Клиент = ТекущиеДанные.КорпКлиент;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьРабочийЛистПоVIN(VIN)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗаконтрактованныеАвтомобилиСрезПоследних.РабочийЛист
		|ИЗ
		|	РегистрСведений.Renault_ЗаконтрактованныеАвтомобили.СрезПоследних(
		|			,
		|			VIN = &vin
		|				И ДатаСнятияРезерва = ДАТАВРЕМЯ(1, 1, 1)) КАК Renault_ЗаконтрактованныеАвтомобилиСрезПоследних";
	Запрос.УстановитьПараметр("VIN", VIN);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РабочийЛист;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКорпКлиентаИзРабочегоЛиста(РабочийЛист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КорпоративныеКлиенты.Ссылка
		|ИЗ
		|	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|			ПО Контрагенты.Ссылка = Renault_РабочиеЛисты.Клиент
		|		ПО Renault_КорпоративныеКлиенты.Контрагент = Контрагенты.Ссылка
		|ГДЕ
		|	Renault_РабочиеЛисты.IDK = &IDK";
	Запрос.УстановитьПараметр("IDK", РабочийЛист);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"Renault_ОтчетПоПродажамВSedre") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры
